Repository: taishingi/hooks
Catalog: po/*/LC_MESSAGES/rust.po
Languages: fr

source: success
fr: succès

source: failure
fr: échec

source: Your code is clean
fr: Votre code est propre

source: Your code is not clean
fr: Votre code n'est pas propre

source: Your code is formatted properly
fr: Votre code est formaté correctement

source: Your code is not formatted properly
fr: Votre code n'est pas formaté correctement

source: Your project is valid
fr: Votre projet est valide

source: Your project is not valid
fr: Votre projet n'est pas valide

source: All tests passes
fr: Tout les tests passes

source: Your tests contains failures
fr: Vos tests contiennent des échecs

source: Your code not contains errors
fr: Votre code ne contient pas d'erreurs

source: Your code contains errors
fr: Votre code contient des erreurs

source: Your code can be share
fr: Votre code peut être partagé

source: Your code contains warnings
fr: Votre code contient des avertissements

source: Your code can be committed
fr: Votre code peut être enregistré

source: Your code can't be committed
fr: Votre code n'est pas valide il ne peux pas être enregistré

source: Show the output ?
fr: Afficher la sortie ?

source: Do you want quit the script now ?
fr: Voulez-vous quitter le script maintenant ?
